Autodesk.Revit.DB.IndependentTag.GetTagBoxMiddlePoints(Autodesk.Revit.DB.View)
Calculates the midpoints of the four bounding box edges around the tag head.
These are the points to which the leader would attach to the tag head.
Remarks:
Elements from the tag family that are marked with EXCLUDE_FROM_LEADER_OUTLINE = true
are included in the box points calculation.
DBView:
If the view is available, it should always be passed. If not, the tag's owner's view will be utilized.
Returns:
The points order is East, West, North, and South.

Autodesk.Revit.DB.IndependentTag.CanLeaderEndConditionBeAssigned(Autodesk.Revit.DB.LeaderEndCondition)
Checks whether the LeaderEndCondition can be changed.
Remarks:
Material tags and material keynotes can only use the free end condition.
leaderEndCondition:
The LeaderEndCondition that will be checked to see if it can be assigned.
Returns:
True if the LeaderEndCondition of the tag can be assigned, or false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.IndependentTag.CanLeaderStartConditionBeAssigned(Autodesk.Revit.DB.LeaderStartCondition)
Checks whether the LeaderStartCondition can be changed.
Remarks:
The LeaderStartCondition controls how the leader start point attaches to the tag head.
Material tags, material keynotes, and realistic rebar bending details can only use the
attached leader start condition.
leaderStartCondition:
The LeaderStartCondition that will be checked to see if it can be assigned.
Returns:
True if the LeaderStartCondition of the tag can be assigned, or false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.IndependentTag.SetLeaderStart(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Sets the free leader start point for the leader to the specified reference.
Remarks:
Tags without leaders or with leaders that use the attached leader start condition do not support free leader start points.
Autodesk.Revit.DB.IndependentTag.LeaderStartCondition for the tag's leader start condition.
referenceTagged:
The reference which is tagged.
freeLeaderStartPoint:
A point representing the free start location for the leader.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no leader start because the tag does not use a free start leader or the leader is not visible.
-or-
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
For this tag leaders are not allowed.
Since:
2027

Autodesk.Revit.DB.IndependentTag.GetLeaderStart(Autodesk.Revit.DB.Reference)
Gets the free leader start point for the leader to the specified reference.
Remarks:
Tags without leaders or with leaders that use the attached leader start condition do not support free leader start points.
Autodesk.Revit.DB.IndependentTag.LeaderStartCondition for the tag's leader start condition.
referenceTagged:
The reference which is tagged.
Returns:
A point representing the free start location for the leader.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no leader start because the tag does not use a free start leader or the leader is not visible.
-or-
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
Since:
2027

Autodesk.Revit.DB.IndependentTag.SetLeaderEnd(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Sets the free end point for the leader to the specified reference.
Remarks:
Tags with attached leader ends or no leaders do not support setting free leader end points.
Autodesk.Revit.DB.IndependentTag.LeaderEndCondition for the tag's leader end condition.
referenceTagged:
The reference which is tagged.
freeLeaderEndPoint:
A point representing the free end location for the leader.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no leader end because the tag does not use a free end leader or the leader is not visible.
-or-
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
For this tag leaders are not allowed.
Since:
2022

Autodesk.Revit.DB.IndependentTag.GetLeaderEnd(Autodesk.Revit.DB.Reference)
Gets the free end point for the leader to the specified reference.
Remarks:
Tags with attached leader ends or no leaders do not return free leader end points.
Autodesk.Revit.DB.IndependentTag.LeaderEndCondition for the tag's leader end condition.
referenceTagged:
The reference which is tagged.
Returns:
A point representing the free end location for the leader.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no leader end because the tag does not use a free end leader or the leader is not visible.
-or-
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
Since:
2022

Autodesk.Revit.DB.IndependentTag.LeaderStartCondition
The leader start condition of the tag, such as if the start of the leader is attached to the tag head or free floating.
Remarks:
Autodesk.Revit.DB.LeaderStartCondition enumerates the supported leader start conditions.
Leaders for material tags and material keynotes can only use the attached start condition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: LeaderStartCondition can't be assigned.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
When setting this property: For this tag leaders are not allowed.
Since:
2027

Autodesk.Revit.DB.IndependentTag.LeaderEndCondition
The leader end condition of the tag, such as if the end of the leader is attached to the host or free floating.
Remarks:
Autodesk.Revit.DB.LeaderEndCondition enumerates the supported leader end conditions.
Material tags and material keynotes can only use the free end condition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: LeaderEndCondition can't be assigned.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The IndependentTag object does not have a tag behavior.
-or-
When setting this property: For this tag leaders are not allowed.